diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <comment>Дипломная работа Володин А.А.</comment>
  <attributes>
    <name>ПериодДляУказанияМесяца</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <comment>Дипломная работа Володин А.А.</comment>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <comment>Дипломная работа Володин А.А.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <comment>Дипломная работа Володин А.А.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <comment>Дипломная работа Володин А.А.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Дипломная работа Володин А.А.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументыРеализаций(Период) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |    ДоговорыКонтрагентов.Владелец КАК Контрагент,
        |    ДоговорыКонтрагентов.Ссылка КАК Ссылка,
        |    ДоговорыКонтрагентов.Организация КАК Организация
        |ПОМЕСТИТЬ ВТ_ДанныеДоговора
        |ИЗ
        |    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |ГДЕ
        |    ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
        |    И &Период
        |        МЕЖДУ ДоговорыКонтрагентов.ВКМ_НачалоДействияДоговора И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействияДоговора
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    РеализацияТоваровУслуг.Ссылка КАК Ссылка,
        |    РеализацияТоваровУслуг.Контрагент КАК Контрагент,
        |    РеализацияТоваровУслуг.Договор КАК Договор
        |ПОМЕСТИТЬ ВТ_ДанныеРеализации
        |ИЗ
        |    Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |ГДЕ
        |    РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
        |    И РеализацияТоваровУслуг.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |    ВТ_ДанныеДоговора.Ссылка КАК Договор,
        |    ВТ_ДанныеРеализации.Ссылка КАК Реализация,
        |    ВТ_ДанныеДоговора.Организация КАК Организация,
        |    ВТ_ДанныеДоговора.Контрагент КАК Контрагент
        |ИЗ
        |    ВТ_ДанныеДоговора КАК ВТ_ДанныеДоговора
        |        ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеРеализации КАК ВТ_ДанныеРеализации
        |        ПО ВТ_ДанныеДоговора.Ссылка = ВТ_ДанныеРеализации.Договор";
    
    Запрос.УстановитьПараметр("Период", Период);
    Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(Период));
    Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(Период));
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    Сч = 0;
    
    МассивРеализаций = Новый Массив;
            
    Пока Выборка.Следующий() Цикл
        
        ДлительныеОперации.СообщитьПрогресс(Цел(Сч / Выборка.Количество() * 100), "Выполняется длительная операция...");
        
        РеализацииСтруктура = Новый Структура;
        
        //если Реализация за выбранный месяц уже создана, то обработка не должна создавать вторую
        Если Не ЗначениеЗаполнено(Выборка.Реализация) Тогда
                
            НоваяРеализация = СозданиеРеализации(Выборка, КонецМесяца(Период));
            
            РеализацииСтруктура.Вставить("Договор", Выборка.Договор);
            РеализацииСтруктура.Вставить("Реализация", НоваяРеализация);
        
        Иначе                
                
            РеализацииСтруктура.Вставить("Договор", Выборка.Договор);
            РеализацииСтруктура.Вставить("Реализация", Выборка.Реализация);
            
            //"для заполнения Реализации необходимо использовать метод модуля объекта Реализации ВыполнитьАвтозаполнение"
            //"Тут подразумевается, что если уже есть документ - он должен дозаполниться."            
            ДокументОбъект = Выборка.Реализация.ПолучитьОбъект();
            ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение(Выборка.Реализация);
            ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
            
        КонецЕсли;

        МассивРеализаций.Добавить(РеализацииСтруктура);
        
        Сч = Сч + 1;
        
    КонецЦикла;
    
    Возврат МассивРеализаций;
    
КонецФункции

Функция СозданиеРеализации(Выборка, Дата)

    НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
    НовыйДокумент.Заполнить(Неопределено); //"при создании Реализации необходимо вызывать стандартный алгоритм заполнения"
                                           //Поскольку у нас нет понимания о документе-основании (ЗаказПокупателя), то передаем Неопределено.
    //Остальные реквизиты заполняем тем, что есть:
    НовыйДокумент.Дата = Дата;
    НовыйДокумент.Договор = Выборка.Договор;
    НовыйДокумент.Контрагент = Выборка.Контрагент;
    НовыйДокумент.Организация = Выборка.Организация;

    Если НовыйДокумент.ПроверитьЗаполнение() Тогда

        Попытка  
            
            НачатьТранзакцию();
            
            НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
            
            ЗафиксироватьТранзакцию();
        
        Исключение
            
            ОтменитьТранзакцию();
            
            ТекстСообщения = НСтр("ru = 'ОБРАБОТКА: Массовое создание актов отменено.
                                        |Не удалось провести документ: %1'");
        
            ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Выборка.Реализация));
            
            ЗаписьЖурналаРегистрации(СтрШаблон(ТекстСообщения, Выборка.Реализация));
            
        КонецПопытки;

    Иначе
        
        НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
               
        ТекстСообщения = НСтр("ru = 'Не удалось провести документ реализации к договору: %1.
                                    |Не все обязательные поля заполнены!'");
        
        ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, Выборка.Договор)); 
        //Ошибка будет выводиться пока поле Основание будет обязательным к заполнению 
        //или не будет понятно какое основание выбирать в запросе.
            
    КонецЕсли;

    //НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение(НовыйДокумент.Ссылка); //Логично было бы новый документ тоже сразу заполнить.
    
    Возврат НовыйДокумент.Ссылка;

КонецФункции

#КонецОбласти

#КонецЕсли
